# Conditional Selection

In [6]:
import numpy as np
import pandas as pd
# import csv file
my_df = pd.read_csv('animal.csv')
my_df2 = pd.read_csv('dog_data.csv')
my_df2

                    Breed              Color        DogName  OwnerZip
0                COCKAPOO              BROWN        CHARLEY   15236.0
1            GER SHEPHERD        BLACK/BROWN         TACODA   15238.0
2           BELG MALINOIS            BRINDLE          15238       NaN
3                   MIXED        BLACK/BROWN          ARROW   15104.0
4     AM PIT BULL TERRIER        WHITE/BROWN         OAKLEY   15139.0
...                   ...                ...            ...       ...
2665         GOLDENDOODLE              BROWN        WINSLOW   15044.0
2666    YORKSHIRE TERRIER        BLACK/BROWN  ROCKY KALAKOS   15220.0
2667              LAB MIX  WHITE/BLACK/BROWN          ELLIE   15220.0
2668         GOLDENDOODLE              WHITE       CLARENCE   15143.0
2669    SHETLAND SHEEPDOG              BLACK        GRIFFIN   15136.0

[2670 rows x 4 columns]

In [ ]:
# conditioan selection
# > < = <= >= etc
# return booleans
my_df2== "BROWN"

0        True
1       False
2       False
3       False
4       False
        ...
2665     True
2666    False
2667    False
2668    False
2669    False
Name: Color, Length: 2670, dtype: bool

In [10]:
# returns datafram with data
my_df2[my_df2== "BROWN"]

     Breed  Color DogName  OwnerZip
0      NaN  BROWN     NaN       NaN
1      NaN    NaN     NaN       NaN
2      NaN    NaN     NaN       NaN
3      NaN    NaN     NaN       NaN
4      NaN    NaN     NaN       NaN
...    ...    ...     ...       ...
2665   NaN  BROWN     NaN       NaN
2666   NaN    NaN     NaN       NaN
2667   NaN    NaN     NaN       NaN
2668   NaN    NaN     NaN       NaN
2669   NaN    NaN     NaN       NaN

[2670 rows x 4 columns]

In [11]:
# run them on a column
my_df2[my_df2 == "BROWN"]["Color"]

0       BROWN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
2665    BROWN
2666      NaN
2667      NaN
2668      NaN
2669      NaN
Name: Color, Length: 2670, dtype: str

In [13]:
my_df2[my_df2 == "BROWN"][["Color", "Breed"]]

      Color Breed
0     BROWN   NaN
1       NaN   NaN
2       NaN   NaN
3       NaN   NaN
4       NaN   NaN
...     ...   ...
2665  BROWN   NaN
2666    NaN   NaN
2667    NaN   NaN
2668    NaN   NaN
2669    NaN   NaN

[2670 rows x 2 columns]

## Multiple conditional selections

In [15]:
# multiple conditinal AND
my_df2[(my_df2["Color"]=="BROWN") & (my_df2["Breed"]=="MIXED")]

      Breed  Color        DogName  OwnerZip
42    MIXED  BROWN         STELLA   15044.0
272   MIXED  BROWN           HANK   15220.0
371   MIXED  BROWN          TEDDY   15136.0
402   MIXED  BROWN      GEORGIOUS   15212.0
505   MIXED  BROWN        HERSHEY   15071.0
523   MIXED  BROWN  MINDY MAZUREK   15037.0
572   MIXED  BROWN          STEVE   15229.0
584   MIXED  BROWN           BEAR   15122.0
602   MIXED  BROWN          CHLOE   15106.0
818   MIXED  BROWN         PEANUT   15025.0
943   MIXED  BROWN        DEE DEE   15031.0
946   MIXED  BROWN           SAGE   15035.0
948   MIXED  BROWN          BELLA   15035.0
995   MIXED  BROWN         MISTER   15139.0
1006  MIXED  BROWN        VANESSA   15065.0
1042  MIXED  BROWN           JACK   15223.0
1123  MIXED  BROWN         BUDDIE   15122.0
1195  MIXED  BROWN         COOPER   15071.0
1204  MIXED  BROWN            POE   15044.0
1211  MIXED  BROWN          EPPEY   15218.0
1258  MIXED  BROWN           BLUE   15235.0
1322  MIXED  BROWN         PHOEBE   15025.0
1466  MIXED  BROWN          JAXIE   15229.0
1476  MIXED  BROWN          PIPPA   15122.0
1659  MIXED  BROWN         ISABEL   15044.0
1780  MIXED  BROWN         WILBUR   15202.0
1798  MIXED  BROWN           PINO   15139.0
1847  MIXED  BROWN         MICKEY   15227.0
2180  MIXED  BROWN           KONA   15102.0
2351  MIXED  BROWN          BELLA   15209.0
2393  MIXED  BROWN         PEANUT   15143.0
2403  MIXED  BROWN           TOBY   15237.0
2430  MIXED  BROWN           LUCY   15229.0
2441  MIXED  BROWN          CASEY   15120.0
2524  MIXED  BROWN         PEANUT   15227.0
2562  MIXED  BROWN           JEFF   15146.0
2581  MIXED  BROWN           BRAX   15143.0
2597  MIXED  BROWN         BAILEY   15065.0

In [16]:
# get length
len(my_df2[(my_df2["Color"]=="BROWN") & (my_df2["Breed"]=="MIXED")])

38

In [17]:
# multiple conditoinal OR
my_df2[(my_df2["Color"]=="BROWN") | (my_df2["Breed"]=="MIXED")]

                   Breed        Color           DogName  OwnerZip
0               COCKAPOO        BROWN           CHARLEY   15236.0
3                  MIXED  BLACK/BROWN             ARROW   15104.0
12      AM PITT BULL MIX        BROWN              KING   15235.0
15                 MIXED        WHITE             RUSTY   15120.0
25            BEAGLE MIX        BROWN  CHRISTINA "TINA"   15025.0
...                  ...          ...               ...       ...
2657        GER SHEPHERD        BROWN             SARAH   15239.0
2658               MIXED        WHITE              LUNA   15017.0
2660              PUGGLE        BROWN              MACY   15044.0
2663  LABRADOR RETRIEVER        BROWN              NINO   15102.0
2665        GOLDENDOODLE        BROWN           WINSLOW   15044.0

[506 rows x 4 columns]

In [18]:
my_df2[(my_df2["Color"]=="BROWN") & (my_df2["Breed"]=="MIXED")]["DogName"]

42             STELLA
272              HANK
371             TEDDY
402         GEORGIOUS
505           HERSHEY
523     MINDY MAZUREK
572             STEVE
584              BEAR
602             CHLOE
818            PEANUT
943           DEE DEE
946              SAGE
948             BELLA
995            MISTER
1006          VANESSA
1042             JACK
1123           BUDDIE
1195           COOPER
1204              POE
1211            EPPEY
1258             BLUE
1322           PHOEBE
1466            JAXIE
1476            PIPPA
1659           ISABEL
1780           WILBUR
1798             PINO
1847           MICKEY
2180             KONA
2351            BELLA
2393           PEANUT
2403             TOBY
2430             LUCY
2441            CASEY
2524           PEANUT
2562             JEFF
2581             BRAX
2597           BAILEY
Name: DogName, dtype: str

## Reset or Change Index

In [19]:
my_df

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No

In [20]:
# create a new column
my_df["frame header"]= ["Animal 1", "Animal 2", "Animal 3","Animal 4"]

In [21]:
my_df

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,frame header
0,1,Lion,Mammal,Savannah,14,190.0,Yes,Animal 1
1,2,Elephant,Mammal,Forest,60,5400.0,Yes,Animal 2
2,3,Parrot,Bird,Rainforest,50,1.2,No,Animal 3
3,4,Shark,Fish,Ocean,30,1100.0,No,Animal 4

In [25]:
# set index
my_df.set_index("frame header", inplace=True)

In [26]:
my_df

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
frame header,,,,,,,
Animal 1,1,Lion,Mammal,Savannah,14,190.0,Yes
Animal 2,2,Elephant,Mammal,Forest,60,5400.0,Yes
Animal 3,3,Parrot,Bird,Rainforest,50,1.2,No
Animal 4,4,Shark,Fish,Ocean,30,1100.0,No

In [29]:
# reset index - change it back tonormal
my_df.reset_index(inplace=True)
my_df

,index,frame header,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,0,Animal 1,1,Lion,Mammal,Savannah,14,190.0,Yes
1,1,Animal 2,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,2,Animal 3,3,Parrot,Bird,Rainforest,50,1.2,No
3,3,Animal 4,4,Shark,Fish,Ocean,30,1100.0,No